<a href="https://colab.research.google.com/github/keerthigoud1536/Bank-Customer-Analytics-Using-SQL/blob/main/BANK_CUSTOMER.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
!apt-get install sqlite3
!pip install pandas

Reading package lists... Done
Building dependency tree... Done
Reading state information... Done
Suggested packages:
  sqlite3-doc
The following NEW packages will be installed:
  sqlite3
0 upgraded, 1 newly installed, 0 to remove and 41 not upgraded.
Need to get 769 kB of archives.
After this operation, 1,874 kB of additional disk space will be used.
Get:1 http://archive.ubuntu.com/ubuntu jammy-updates/main amd64 sqlite3 amd64 3.37.2-2ubuntu0.5 [769 kB]
Fetched 769 kB in 1s (792 kB/s)
Selecting previously unselected package sqlite3.
(Reading database ... 121689 files and directories currently installed.)
Preparing to unpack .../sqlite3_3.37.2-2ubuntu0.5_amd64.deb ...
Unpacking sqlite3 (3.37.2-2ubuntu0.5) ...
Setting up sqlite3 (3.37.2-2ubuntu0.5) ...
Processing triggers for man-db (2.10.2-1) ...
Requirement already satisfied: pandas in /usr/local/lib/python3.12/dist-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in /usr/local/lib/python3.12/dist-packages (from pandas) (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.12/dist-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.12/dist-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.12/dist-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.12/dist-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [4]:
import sqlite3
import pandas as pd
import os

In [5]:
conn = sqlite3.connect("my_database.db")

In [6]:
# Define the correct path for the database
db_path ="/content/drive/MyDrive/my_database.db"

In [7]:
db_folder = "/content/drive/MyDrive/db_folder"
os.makedirs(db_folder, exist_ok=True)  # Ensure the folder exists
db_path = os.path.join(db_folder, "my_database.db")

conn = sqlite3.connect(db_path)
cursor = conn.cursor()

print("Database connected at:", db_path)

Database connected at: /content/drive/MyDrive/db_folder/my_database.db

**CUSTOMER TABLE**

In [8]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS CUSTOMER1( customer_id INT ,
             	customer_name VARCHAR(20),
             	Address 	VARCHAR(20),
             	state_code  VARCHAR(3) ,
             	Telephone   VARCHAR(10)	);

''')
conn.commit()

In [9]:
def insert_CUSTOMER (customer_id,customer_name,Address,state_code,Telephone):
    cursor.execute("INSERT INTO CUSTOMER1 (customer_id,customer_name,Address,state_code,Telephone) VALUES (?,?, ?, ?,?)", (customer_id,customer_name,Address,state_code,Telephone))
    conn.commit()

# Inserti
insert_CUSTOMER(123001,"Oliver", "225-5,Emeryville", "CA" , "1897614500")
insert_CUSTOMER(123002,"George", "194-6,New brighton","MN" , "1897617000")
insert_CUSTOMER(123003,"Harry", "2909-5,walnut creek","CA" , "1897617866")
insert_CUSTOMER(123004,"Jack", "229-5, Concord",  	"CA" , "1897627999")
insert_CUSTOMER(123005,"Jacob", "325-7, Mission Dist","SFO", "1897637000")
insert_CUSTOMER(123006,"Noah", "275-9, saint-paul" ,  "MN" , "1897613200")
insert_CUSTOMER(123007,"Charlie","125-1,Richfield",   "MN" , "1897617666")
insert_CUSTOMER(123008,"Robin","3005-1,Heathrow", 	"NY" , "1897614000")

In [10]:
!pip install tabulate

Requirement already satisfied: tabulate in /usr/local/lib/python3.12/dist-packages (0.9.0)

In [11]:
from tabulate import tabulate


# Fetch data
cursor.execute("SELECT * FROM CUSTOMER1 ")
rows = cursor.fetchall()

# Get column names
column_names = [desc[0] for desc in cursor.description]

# Print in tabular format
print(tabulate(rows, headers=column_names, tablefmt="grid"))

+---------------+-----------------+---------------------+--------------+-------------+
|   customer_id | customer_name   | Address             | state_code   |   Telephone |
+===============+=================+=====================+==============+=============+
|        123001 | Oliver          | 225-5,Emeryville    | CA           |  1897614500 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123002 | George          | 194-6,New brighton  | MN           |  1897617000 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123003 | Harry           | 2909-5,walnut creek | CA           |  1897617866 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123004 | Jack            | 229-5, Concord      | CA           |  1897627999 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123005 | Jacob           | 325-7, Mission Dist | SFO          |  1897637000 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123006 | Noah            | 275-9, saint-paul   | MN           |  1897613200 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123007 | Charlie         | 125-1,Richfield     | MN           |  1897617666 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123008 | Robin           | 3005-1,Heathrow     | NY           |  1897614000 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123001 | Oliver          | 225-5,Emeryville    | CA           |  1897614500 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123002 | George          | 194-6,New brighton  | MN           |  1897617000 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123003 | Harry           | 2909-5,walnut creek | CA           |  1897617866 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123004 | Jack            | 229-5, Concord      | CA           |  1897627999 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123005 | Jacob           | 325-7, Mission Dist | SFO          |  1897637000 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123006 | Noah            | 275-9, saint-paul   | MN           |  1897613200 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123007 | Charlie         | 125-1,Richfield     | MN           |  1897617666 |
+---------------+-----------------+---------------------+--------------+-------------+
|        123008 | Robin           | 3005-1,Heathrow     | NY           |  1897614000 |
+---------------+-----------------+---------------------+--------------+-------------+

1.Print customer Id, customer name and average account_balance maintained by each customer for all of his/her accounts in the bank.(8 Rows)

In [12]:
cursor.execute('''DROP TABLE IF EXISTS BANK_ACCOUNT1;''')
conn.commit()
cursor.execute('''
CREATE TABLE BANK_ACCOUNT1 ( Customer_id INT,
	                Account_Number VARCHAR(19),
		     Account_type VARCHAR(25),
		     Balance_amount INT ,
			Account_status VARCHAR(10), Relation_ship varchar(1) ) ;
''')
conn.commit()

# Insert records:
cursor.execute('''
INSERT INTO BANK_ACCOUNT1  VALUES (123001, "4000-1956-3456",  "SAVINGS"            , 200000 ,"ACTIVE","P");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT1  VALUES (123001, "5000-1700-3456",  "RECURRING DEPOSITS" ,9400000 ,"ACTIVE","S");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT1  VALUES (123002, "4000-1956-2001",  "SAVINGS"            , 400000 ,"ACTIVE","P");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT1  VALUES (123002, "5000-1700-5001",  "RECURRING DEPOSITS" ,7500000 ,"ACTIVE","S");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT1  VALUES (123003, "4000-1956-2900",  "SAVINGS"            ,750000,"INACTIVE","P");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT1  VALUES (123004, "5000-1700-6091",  "RECURRING DEPOSITS" ,7500000 ,"ACTIVE","S");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT1  VALUES (123004, "4000-1956-3401",  "SAVINGS"            , 655000 ,"ACTIVE","P");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT1  VALUES (123005, "4000-1956-5102",  "SAVINGS"            , 300000 ,"ACTIVE","P");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT1  VALUES (123006, "4000-1956-5698",  "SAVINGS"            , 455000 ,"ACTIVE" ,"P");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT1  VALUES (123007, "5000-1700-9800",  "SAVINGS"            , 355000 ,"ACTIVE" ,"P");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT1  VALUES (123007, "4000-1956-9977",  "RECURRING DEPOSITS" , 7025000,"ACTIVE" ,"S");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT1  VALUES (123007, "9000-1700-7777-4321",  "CREDITCARD"    ,0      ,"INACTIVE","P");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT1  VALUES (123008, "5000-1700-7755",  "SAVINGS"            ,NULL   ,"INACTIVE","P");
''')
conn.commit()

In [13]:
# SQL query to get customer_id, customer_name, and average balance amount
query = """
SELECT
    c.customer_id,
    c.customer_name,
    AVG(a.Balance_amount) AS avg_balance
FROM CUSTOMER1 c
LEFT JOIN BANK_ACCOUNT1 a ON c.customer_id = a.Customer_id
GROUP BY c.customer_id, c.customer_name
LIMIT 8;  -- Show only 8 rows
"""

# Execute the query
cursor.execute(query)

# Fetch column names
columns = [desc[0] for desc in cursor.description]

# Fetch all results
results = cursor.fetchall()

# Print table headers
print("{:<12} {:<20} {:<15}".format(*columns))
print("-" * 50)

# Print each row in a properly formatted way
for row in results:
    customer_id, customer_name, avg_balance = row
    if avg_balance is None:
        avg_balance_str = "N/A"
    else:
        avg_balance_str = "{:.2f}".format(avg_balance)
    print("{:<12} {:<20} {:<15}".format(customer_id, customer_name, avg_balance_str))

customer_id  customer_name        avg_balance
--------------------------------------------------
123001       Oliver               4800000.00
123002       George               3950000.00
123003       Harry                750000.00
123004       Jack                 4077500.00
123005       Jacob                300000.00
123006       Noah                 455000.00
123007       Charlie              2460000.00
123008       Robin                N/A

In [14]:
cursor.execute('''DROP TABLE IF EXISTS Bank_Account_Relationship_Details1;''')
conn.commit()

cursor.execute('''
CREATE TABLE Bank_Account_Relationship_Details1
                             	( Customer_id INT,
				Account_Number VARCHAR(19),
                            	Account_type VARCHAR(25),
                             	Linking_Account_Number VARCHAR(19));
''')
conn.commit()

cursor.execute('''
INSERT INTO Bank_Account_Relationship_Details1  VALUES (123001, "4000-1956-3456",  "SAVINGS" , "");
''')
cursor.execute('''
INSERT INTO Bank_Account_Relationship_Details1  VALUES (123001, "5000-1700-3456",  "RECURRING DEPOSITS" , "4000-1956-3456");
''')
cursor.execute('''
INSERT INTO Bank_Account_Relationship_Details1  VALUES (123002, "4000-1956-2001",  "SAVINGS" , "" );
''')
cursor.execute('''
INSERT INTO Bank_Account_Relationship_Details1  VALUES (123002, "5000-1700-5001",  "RECURRING DEPOSITS" , "4000-1956-2001" );
''')
cursor.execute('''
INSERT INTO Bank_Account_Relationship_Details1  VALUES (123003, "4000-1956-2900",  "SAVINGS" , "" );
''')
cursor.execute('''
INSERT INTO Bank_Account_Relationship_Details1  VALUES (123004, "5000-1700-6091",  "RECURRING DEPOSITS" , "4000-1956-2900" );
''')
cursor.execute('''
INSERT INTO Bank_Account_Relationship_Details1  VALUES (123004, "5000-1700-7791",  "RECURRING DEPOSITS" , "4000-1956-2900" );
''')
cursor.execute('''
INSERT INTO Bank_Account_Relationship_Details1  VALUES (123007, "5000-1700-9800",  "SAVINGS" , "" );
''')
cursor.execute('''
INSERT INTO Bank_Account_Relationship_Details1  VALUES (123007, "4000-1956-9977",  "RECURRING DEPOSITS" , "5000-1700-9800" );
''')
cursor.execute('''
INSERT INTO Bank_Account_Relationship_Details1  VALUES (NULL, "9000-1700-7777-4321",  "Credit Card" , "5000-1700-9800" );
''')
cursor.execute('''
INSERT INTO Bank_Account_Relationship_Details1  VALUES (NULL, '5900-1900-9877-5543', 'Add-on Credit Card', '9000-1700-7777-4321' );
''')
cursor.execute('''
INSERT INTO Bank_Account_Relationship_Details1  VALUES (NULL, '5800-1700-9800-7755', 'Credit Card', '4000-1956-5698' );
''')
cursor.execute('''
INSERT INTO Bank_Account_Relationship_Details1  VALUES (NULL, '5890-1970-7706-8912', 'Add-on Credit Card', '5800-1700-9800-7755' );
''')
conn.commit()

In [15]:
#2) Print customer_id , account_number and balance_amount , condition that if balance_amount is nil then assign transaction_amount  for account_type = "Credit Card"(4 Rows).
query = """
SELECT
    a.customer_id,
    a.account_number,
    COALESCE(a.Balance_amount, 0) AS balance_amount
FROM BANK_ACCOUNT1 a
WHERE a.Account_type = 'CREDITCARD'
LIMIT 4;
"""
result = pd.read_sql_query(query, conn)
print(tabulate(result, headers='keys', tablefmt='psql'))

+----+---------------+---------------------+------------------+
|    |   Customer_id | Account_Number      |   balance_amount |
|----+---------------+---------------------+------------------|
|  0 |        123007 | 9000-1700-7777-4321 |                0 |
+----+---------------+---------------------+------------------+

In [ ]:
# 3) Print account_number and balance_amount , transaction_amount,Transaction_Date from Bank_Account_Details
#and bank_account_transaction for all the transactions occurred during march,2020 and april, 2020(12 Rows)

In [16]:
cursor.execute('''DROP TABLE IF EXISTS BANK_ACCOUNT_TRANSACTION1;''')
conn.commit()
# CREATE TABLE BANK_ACCOUNT_TRANSACTION
cursor.execute('''
CREATE TABLE BANK_ACCOUNT_TRANSACTION1(
              	Account_Number VARCHAR(19),
              	Transaction_amount Decimal(18,2) ,
              	Transcation_channel VARCHAR(18) ,
             	Province varchar(3) ,
             	Transaction_Date Date) ;
''')
conn.commit()

cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "4000-1956-3456",  -2000, "ATM withdrawl" , "CA", "2020-01-13");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "4000-1956-2001",  -4000, "POS-Walmart"   , "MN", "2020-02-14");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "4000-1956-2001",  -1600, "UPI transfer"  , "MN", "2020-01-19");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "4000-1956-2001",  -6000, "Bankers cheque", "CA", "2020-03-23");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "4000-1956-2001",  -3000, "Net banking"   , "CA", "2020-04-24");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "4000-1956-2001",  23000, "cheque deposit", "MN", "2020-03-15");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "5000-1700-6091",  40000, "ECS transfer"  , "NY", "2020-02-19");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "5000-1700-7791",  40000, "ECS transfer"  , "NY", "2020-02-19");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "4000-1956-3401",   8000, "Cash Deposit"  , "NY", "2020-01-19");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "4000-1956-5102",  -6500, "ATM withdrawal" , "NY", "2020-03-14");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "4000-1956-5698",  -9000, "Cash Deposit"  , "NY", "2020-03-27");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "4000-1956-9977",  50000, "ECS transfer"  , "NY", "2020-01-16");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "9000-1700-7777-4321",  -5000, "POS-Walmart", "NY", "2020-02-17");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "9000-1700-7777-4321",  -8000, "Shopping Cart", "MN", "2020-03-13");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "9000-1700-7777-4321",  -2500, "Shopping Cart", "MN", "2020-04-21");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( "5800-1700-9800-7755", -9000, "POS-Walmart","MN", "2020-04-13");
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1 VALUES ( '5890-1970-7706-8912', -11000, "Shopping Cart" , "NY" , "2020-03-12") ;
''')
conn.commit()

In [17]:
#3) Print account_number and balance_amount , transaction_amount,Transaction_Date from Bank_Account_Details and bank_account_transaction for all the transactions occurred during march,2020 and april, 2020(12 Rows)

query="""
SELECT a.Account_Number, a.Balance_amount, t.Transaction_amount, t.Transaction_Date
FROM BANK_ACCOUNT_TRANSACTION1 t
JOIN BANK_ACCOUNT1 a ON t.Account_Number = a.Account_Number
WHERE t.Transaction_Date BETWEEN '2020-03-01' AND '2020-04-30'
"""
result = pd.read_sql_query(query, conn)
print(tabulate(result, headers='keys', tablefmt='psql'))

+----+---------------------+------------------+----------------------+--------------------+
|    | Account_Number      |   Balance_amount |   Transaction_amount | Transaction_Date   |
|----+---------------------+------------------+----------------------+--------------------|
|  0 | 4000-1956-2001      |           400000 |                -6000 | 2020-03-23         |
|  1 | 4000-1956-2001      |           400000 |                -3000 | 2020-04-24         |
|  2 | 4000-1956-2001      |           400000 |                23000 | 2020-03-15         |
|  3 | 4000-1956-5102      |           300000 |                -6500 | 2020-03-14         |
|  4 | 4000-1956-5698      |           455000 |                -9000 | 2020-03-27         |
|  5 | 9000-1700-7777-4321 |                0 |                -8000 | 2020-03-13         |
|  6 | 9000-1700-7777-4321 |                0 |                -2500 | 2020-04-21         |
+----+---------------------+------------------+----------------------+--------------------+

In [18]:
# Question 4:
# 4) Print all of the customer id, account number,  balance_amount, transaction_amount , Transaction_Date  from CUSTOMER, BANK_ACCOUNT and
#bank_account_transaction tables where excluding all of their transactions in march, 2020  month (22 Rows)

query="""
SELECT c.customer_id, a.Account_Number, a.Balance_amount, t.Transaction_amount, t.Transaction_Date
FROM CUSTOMER1 c
JOIN BANK_ACCOUNT1 a ON c.customer_id = a.Customer_id
JOIN BANK_ACCOUNT_TRANSACTION1 t ON a.Account_Number = t.Account_Number
WHERE t.Transaction_Date NOT BETWEEN '2020-03-01' AND '2020-03-31'
"""
result = pd.read_sql_query(query, conn)
print(tabulate(result, headers='keys', tablefmt='psql'))

+----+---------------+---------------------+------------------+----------------------+--------------------+
|    |   customer_id | Account_Number      |   Balance_amount |   Transaction_amount | Transaction_Date   |
|----+---------------+---------------------+------------------+----------------------+--------------------|
|  0 |        123001 | 4000-1956-3456      |           200000 |                -2000 | 2020-01-13         |
|  1 |        123001 | 4000-1956-3456      |           200000 |                -2000 | 2020-01-13         |
|  2 |        123002 | 4000-1956-2001      |           400000 |                -4000 | 2020-02-14         |
|  3 |        123002 | 4000-1956-2001      |           400000 |                -4000 | 2020-02-14         |
|  4 |        123002 | 4000-1956-2001      |           400000 |                -1600 | 2020-01-19         |
|  5 |        123002 | 4000-1956-2001      |           400000 |                -1600 | 2020-01-19         |
|  6 |        123002 | 4000-1956-2001      |           400000 |                -3000 | 2020-04-24         |
|  7 |        123002 | 4000-1956-2001      |           400000 |                -3000 | 2020-04-24         |
|  8 |        123004 | 5000-1700-6091      |          7500000 |                40000 | 2020-02-19         |
|  9 |        123004 | 5000-1700-6091      |          7500000 |                40000 | 2020-02-19         |
| 10 |        123004 | 4000-1956-3401      |           655000 |                 8000 | 2020-01-19         |
| 11 |        123004 | 4000-1956-3401      |           655000 |                 8000 | 2020-01-19         |
| 12 |        123007 | 4000-1956-9977      |          7025000 |                50000 | 2020-01-16         |
| 13 |        123007 | 4000-1956-9977      |          7025000 |                50000 | 2020-01-16         |
| 14 |        123007 | 9000-1700-7777-4321 |                0 |                -5000 | 2020-02-17         |
| 15 |        123007 | 9000-1700-7777-4321 |                0 |                -5000 | 2020-02-17         |
| 16 |        123007 | 9000-1700-7777-4321 |                0 |                -2500 | 2020-04-21         |
| 17 |        123007 | 9000-1700-7777-4321 |                0 |                -2500 | 2020-04-21         |
+----+---------------+---------------------+------------------+----------------------+--------------------+

In [ ]:
# 5) Print only the customer id, account_number, balance_amount,transaction_amount ,transaction_date who did transactions during the first quarter.
# Do not display the accounts if they have not done any transactions in the first quarter.(16 Rows)

query="""
SELECT c.customer_id, a.Account_Number, a.Balance_amount, t.Transaction_amount, t.Transaction_Date
FROM CUSTOMER1 c
JOIN BANK_ACCOUNT1 a ON c.customer_id = a.Customer_id
JOIN BANK_ACCOUNT_TRANSACTION1 t ON a.Account_Number = t.Account_Number
WHERE t.Transaction_Date BETWEEN '2020-01-01' AND '2020-03-31'
"""
result = pd.read_sql_query(query, conn)
print(tabulate(result, headers='keys', tablefmt='psql'))

+----+---------------+---------------------+------------------+----------------------+--------------------+
|    |   customer_id | Account_Number      |   Balance_amount |   Transaction_amount | Transaction_Date   |
|----+---------------+---------------------+------------------+----------------------+--------------------|
|  0 |        123001 | 4000-1956-3456      |           200000 |                -2000 | 2020-01-13         |
|  1 |        123002 | 4000-1956-2001      |           400000 |                -4000 | 2020-02-14         |
|  2 |        123002 | 4000-1956-2001      |           400000 |                -1600 | 2020-01-19         |
|  3 |        123002 | 4000-1956-2001      |           400000 |                -6000 | 2020-03-23         |
|  4 |        123002 | 4000-1956-2001      |           400000 |                23000 | 2020-03-15         |
|  5 |        123004 | 5000-1700-6091      |          7500000 |                40000 | 2020-02-19         |
|  6 |        123004 | 4000-1956-3401      |           655000 |                 8000 | 2020-01-19         |
|  7 |        123005 | 4000-1956-5102      |           300000 |                -6500 | 2020-03-14         |
|  8 |        123006 | 4000-1956-5698      |           455000 |                -9000 | 2020-03-27         |
|  9 |        123007 | 4000-1956-9977      |          7025000 |                50000 | 2020-01-16         |
| 10 |        123007 | 9000-1700-7777-4321 |                0 |                -5000 | 2020-02-17         |
| 11 |        123007 | 9000-1700-7777-4321 |                0 |                -8000 | 2020-03-13         |
+----+---------------+---------------------+------------------+----------------------+--------------------+

In [19]:
# 6) Print account_number, Event and Customer_message from BANK_CUSTOMER_MESSAGES and Bank_Account_Details to display an “Adhoc”
# Event for all customers who have  “SAVINGS" account_type account.(8 Rows)

# Create BANK_CUSTOMER_MESSAGES table
cursor.execute('''DROP TABLE IF EXISTS BANK_CUSTOMER_MESSAGES;''')
conn.commit()
cursor.execute('''
CREATE TABLE BANK_CUSTOMER_MESSAGES (
              	Event VARCHAR(24),
              	Customer_message VARCHAR(75),
              	Notice_delivery_mode VARCHAR(15)) ;
''')
conn.commit()

# Insert records into BANK_CUSTOMER_MESSAGES
cursor.execute('''
INSERT INTO BANK_CUSTOMER_MESSAGES VALUES ( "Adhoc", "All Banks are closed due to announcement of National strike", "mobile" ) ;
''')
cursor.execute('''
INSERT INTO BANK_CUSTOMER_MESSAGES VALUES ( "Transaction Limit", "Only limited withdrawals per card are allowed from ATM machines", "mobile" );
''')
conn.commit()

# These are additional inserts for bank_account_transaction, ensuring they are properly executed.
# inserted for queries after 17th
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1(Account_Number, Transaction_amount, Transcation_channel, Province, Transaction_Date) VALUES
('4000-1956-9977' ,    10000.00     ,'ECS transfer',     'MN' ,    '2020-02-16' ) ;
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1(Account_Number, Transaction_amount, Transcation_channel, Province, Transaction_Date) VALUES
('4000-1956-9977' ,    40000.00     ,'ECS transfer',     'MN' ,    '2020-03-18' ) ;
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1(Account_Number, Transaction_amount, Transcation_channel, Province, Transaction_Date) VALUES
('4000-1956-9977' ,    60000.00     ,'ECS transfer',     'MN' ,    '2020-04-18' ) ;
''')
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1(Account_Number, Transaction_amount, Transcation_channel, Province, Transaction_Date) VALUES
('4000-1956-9977' ,    20000.00     ,'ECS transfer',     'MN' ,    '2020-03-20' ) ;
''')
# inserted for queries after 24th
cursor.execute('''
INSERT INTO BANK_ACCOUNT_TRANSACTION1(Account_Number, Transaction_amount, Transcation_channel, Province, Transaction_Date) VALUES
('4000-1956-9977' ,    49000.00     ,'ECS transfer',     'MN' ,    '2020-06-18' ) ;
''')
conn.commit()

# Now, execute the query for question 6
query = """
SELECT
    ba.Account_Number,
    bcm.Event,
    bcm.Customer_message
FROM
    BANK_ACCOUNT1 ba
JOIN
    BANK_CUSTOMER_MESSAGES bcm ON bcm.Event = 'Adhoc' -- Assuming 'Adhoc' is the event we are looking for
WHERE
    ba.Account_type = 'SAVINGS'
LIMIT 8;
"""
result = pd.read_sql_query(query, conn)
print(tabulate(result, headers='keys', tablefmt='psql'))

+----+------------------+---------+-------------------------------------------------------------+
|    | Account_Number   | Event   | Customer_message                                            |
|----+------------------+---------+-------------------------------------------------------------|
|  0 | 4000-1956-3456   | Adhoc   | All Banks are closed due to announcement of National strike |
|  1 | 4000-1956-2001   | Adhoc   | All Banks are closed due to announcement of National strike |
|  2 | 4000-1956-2900   | Adhoc   | All Banks are closed due to announcement of National strike |
|  3 | 4000-1956-3401   | Adhoc   | All Banks are closed due to announcement of National strike |
|  4 | 4000-1956-5102   | Adhoc   | All Banks are closed due to announcement of National strike |
|  5 | 4000-1956-5698   | Adhoc   | All Banks are closed due to announcement of National strike |
|  6 | 5000-1700-9800   | Adhoc   | All Banks are closed due to announcement of National strike |
|  7 | 5000-1700-7755   | Adhoc   | All Banks are closed due to announcement of National strike |
+----+------------------+---------+-------------------------------------------------------------+

In [20]:
# 7) Print all Customer_id, Account_Number, Account_type, and display deducted balance_amount by
 #subtracting only negative transaction_amounts for Relationship_type ="P" ( P - means  Primary , S - means Secondary ) .(27 Rows)

query="""
SELECT
    c.customer_id,
    a.Account_Number,
    a.Account_type,
    (a.Balance_amount + COALESCE(SUM(CASE WHEN t.Transaction_amount < 0 THEN t.Transaction_amount ELSE 0 END), 0)) AS deducted_balance_amount
FROM
    CUSTOMER1 c
JOIN
    BANK_ACCOUNT1 a ON c.customer_id = a.Customer_id
LEFT JOIN
    BANK_ACCOUNT_TRANSACTION1 t ON a.Account_Number = t.Account_Number
WHERE
    a.Relation_ship = 'P'
GROUP BY
    c.customer_id, a.Account_Number, a.Account_type, a.Balance_amount
ORDER BY
    c.customer_id, a.Account_Number;
"""
result = pd.read_sql_query(query, conn)
print(tabulate(result, headers='keys', tablefmt='psql'))

+----+---------------+---------------------+----------------+---------------------------+
|    |   customer_id | Account_Number      | Account_type   |   deducted_balance_amount |
|----+---------------+---------------------+----------------+---------------------------|
|  0 |        123001 | 4000-1956-3456      | SAVINGS        |                    196000 |
|  1 |        123002 | 4000-1956-2001      | SAVINGS        |                    370800 |
|  2 |        123003 | 4000-1956-2900      | SAVINGS        |                    750000 |
|  3 |        123004 | 4000-1956-3401      | SAVINGS        |                    655000 |
|  4 |        123005 | 4000-1956-5102      | SAVINGS        |                    287000 |
|  5 |        123006 | 4000-1956-5698      | SAVINGS        |                    437000 |
|  6 |        123007 | 5000-1700-9800      | SAVINGS        |                    355000 |
|  7 |        123007 | 9000-1700-7777-4321 | CREDITCARD     |                    -31000 |
|  8 |        123008 | 5000-1700-7755      | SAVINGS        |                       nan |
+----+---------------+---------------------+----------------+---------------------------+

In [21]:
# 8 a) Display records of All Accounts , their Account_types, the transaction amount.
# b) Along with first step, Display other columns with corresponding linking account number, account types (15 Rows)

query="""
SELECT
    ba.Account_Number,
    ba.Account_type AS main_account_type,
    bat.Transaction_amount,
    bard.Linking_Account_Number,
    bard.Account_type AS relationship_account_type
FROM
    BANK_ACCOUNT1 ba
LEFT JOIN
    BANK_ACCOUNT_TRANSACTION1 bat ON ba.Account_Number = bat.Account_Number
LEFT JOIN
    Bank_Account_Relationship_Details1 bard ON ba.Account_Number = bard.Account_Number
LIMIT 15;
"""
result = pd.read_sql_query(query, conn)
print(tabulate(result, headers='keys', tablefmt='psql'))

+----+------------------+---------------------+----------------------+--------------------------+-----------------------------+
|    | Account_Number   | main_account_type   |   Transaction_amount | Linking_Account_Number   | relationship_account_type   |
|----+------------------+---------------------+----------------------+--------------------------+-----------------------------|
|  0 | 4000-1956-3456   | SAVINGS             |                -2000 |                          | SAVINGS                     |
|  1 | 5000-1700-3456   | RECURRING DEPOSITS  |                  nan | 4000-1956-3456           | RECURRING DEPOSITS          |
|  2 | 4000-1956-2001   | SAVINGS             |                -6000 |                          | SAVINGS                     |
|  3 | 4000-1956-2001   | SAVINGS             |                -4000 |                          | SAVINGS                     |
|  4 | 4000-1956-2001   | SAVINGS             |                -3000 |                          | SAVINGS                     |
|  5 | 4000-1956-2001   | SAVINGS             |                -1600 |                          | SAVINGS                     |
|  6 | 4000-1956-2001   | SAVINGS             |                23000 |                          | SAVINGS                     |
|  7 | 5000-1700-5001   | RECURRING DEPOSITS  |                  nan | 4000-1956-2001           | RECURRING DEPOSITS          |
|  8 | 4000-1956-2900   | SAVINGS             |                  nan |                          | SAVINGS                     |
|  9 | 5000-1700-6091   | RECURRING DEPOSITS  |                40000 | 4000-1956-2900           | RECURRING DEPOSITS          |
| 10 | 4000-1956-3401   | SAVINGS             |                 8000 |                          |                             |
| 11 | 4000-1956-5102   | SAVINGS             |                -6500 |                          |                             |
| 12 | 4000-1956-5698   | SAVINGS             |                -9000 |                          |                             |
| 13 | 5000-1700-9800   | SAVINGS             |                  nan |                          | SAVINGS                     |
| 14 | 4000-1956-9977   | RECURRING DEPOSITS  |                10000 | 5000-1700-9800           | RECURRING DEPOSITS          |
+----+------------------+---------------------+----------------------+--------------------------+-----------------------------+

In [33]:
9.# a) Display records of All Accounts , their Account_types, the transaction amount.
# b) Along with first step, Display other columns with corresponding linking account number, account types
# c) After retrieving all records of accounts and their linked accounts, display the   transaction amount of accounts appeared  in another column.(26 Rows)
query ="""
SELECT
     ba.Account_Number,
    ba.Account_type AS main_account_type,
    bat.Transaction_amount,
    bard.Linking_Account_Number,
    bard.Account_type AS relationship_account_type,
    bat2.Transaction_amount AS linked_account_transaction_amount
FROM
    BANK_ACCOUNT1 ba
    LEFT JOIN
    BANK_ACCOUNT_TRANSACTION1 bat ON ba.Account_Number = bat.Account_Number
    LEFT JOIN
    Bank_Account_Relationship_Details1 bard ON ba.Account_Number = bard.Account_Number
    LEFT JOIN
    BANK_ACCOUNT_TRANSACTION1 bat2 ON bard.Linking_Account_Number = bat2.Account_Number
LIMIT 26;
"""
result = pd.read_sql_query(query, conn)
print(tabulate(result, headers='keys', tablefmt='psql'))

+----+---------------------+---------------------+----------------------+--------------------------+-----------------------------+-------------------------------------+
|    | Account_Number      | main_account_type   |   Transaction_amount | Linking_Account_Number   | relationship_account_type   |   linked_account_transaction_amount |
|----+---------------------+---------------------+----------------------+--------------------------+-----------------------------+-------------------------------------|
|  0 | 4000-1956-3456      | SAVINGS             |                -2000 |                          | SAVINGS                     |                                 nan |
|  1 | 5000-1700-3456      | RECURRING DEPOSITS  |                  nan | 4000-1956-3456           | RECURRING DEPOSITS          |                               -2000 |
|  2 | 4000-1956-2001      | SAVINGS             |                -6000 |                          | SAVINGS                     |                                 nan |
|  3 | 4000-1956-2001      | SAVINGS             |                -4000 |                          | SAVINGS                     |                                 nan |
|  4 | 4000-1956-2001      | SAVINGS             |                -3000 |                          | SAVINGS                     |                                 nan |
|  5 | 4000-1956-2001      | SAVINGS             |                -1600 |                          | SAVINGS                     |                                 nan |
|  6 | 4000-1956-2001      | SAVINGS             |                23000 |                          | SAVINGS                     |                                 nan |
|  7 | 5000-1700-5001      | RECURRING DEPOSITS  |                  nan | 4000-1956-2001           | RECURRING DEPOSITS          |                               -6000 |
|  8 | 5000-1700-5001      | RECURRING DEPOSITS  |                  nan | 4000-1956-2001           | RECURRING DEPOSITS          |                               -4000 |
|  9 | 5000-1700-5001      | RECURRING DEPOSITS  |                  nan | 4000-1956-2001           | RECURRING DEPOSITS          |                               -3000 |
| 10 | 5000-1700-5001      | RECURRING DEPOSITS  |                  nan | 4000-1956-2001           | RECURRING DEPOSITS          |                               -1600 |
| 11 | 5000-1700-5001      | RECURRING DEPOSITS  |                  nan | 4000-1956-2001           | RECURRING DEPOSITS          |                               23000 |
| 12 | 4000-1956-2900      | SAVINGS             |                  nan |                          | SAVINGS                     |                                 nan |
| 13 | 5000-1700-6091      | RECURRING DEPOSITS  |                40000 | 4000-1956-2900           | RECURRING DEPOSITS          |                                 nan |
| 14 | 4000-1956-3401      | SAVINGS             |                 8000 |                          |                             |                                 nan |
| 15 | 4000-1956-5102      | SAVINGS             |                -6500 |                          |                             |                                 nan |
| 16 | 4000-1956-5698      | SAVINGS             |                -9000 |                          |                             |                                 nan |
| 17 | 5000-1700-9800      | SAVINGS             |                  nan |                          | SAVINGS                     |                                 nan |
| 18 | 4000-1956-9977      | RECURRING DEPOSITS  |                10000 | 5000-1700-9800           | RECURRING DEPOSITS          |                                 nan |
| 19 | 4000-1956-9977      | RECURRING DEPOSITS  |                20000 | 5000-1700-9800           | RECURRING DEPOSITS          |                                 nan |
| 20 | 4000-1956-9977      | RECURRING DEPOSITS  |                40000 | 5000-1700-9800           | RECURRING DEPOSITS          |                                 nan |
| 21 | 4000-1956-9977      | RECURRING DEPOSITS  |                49000 | 5000-1700-9800           | RECURRING DEPOSITS          |                                 nan |
| 22 | 4000-1956-9977      | RECURRING DEPOSITS  |                50000 | 5000-1700-9800           | RECURRING DEPOSITS          |                                 nan |
| 23 | 4000-1956-9977      | RECURRING DEPOSITS  |                60000 | 5000-1700-9800           | RECURRING DEPOSITS          |                                 nan |
| 24 | 9000-1700-7777-4321 | CREDITCARD          |                -8000 | 5000-1700-9800           | Credit Card                 |                                 nan |
| 25 | 9000-1700-7777-4321 | CREDITCARD          |                -5000 | 5000-1700-9800           | Credit Card                 |                                 nan |
+----+---------------------+---------------------+----------------------+--------------------------+-----------------------------+-------------------------------------+

In [26]:
# 10) Display all saving account holders have “Add-on Credit Cards" and “Credit cards" (3 Rows)
query="""
WITH AccountOwner AS (
    -- Level 0: Direct accounts from BANK_ACCOUNT1
    SELECT Customer_id, Account_Number, Account_type FROM BANK_ACCOUNT1
    UNION ALL
    -- Level 1: Accounts linked directly to BANK_ACCOUNT1 accounts
    SELECT
        ba.Customer_id,
        bard_l1.Account_Number,
        bard_l1.Account_type
    FROM
        Bank_Account_Relationship_Details1 bard_l1
    JOIN
        BANK_ACCOUNT1 ba ON bard_l1.Linking_Account_Number = ba.Account_Number
    WHERE
        bard_l1.Customer_id IS NULL
    UNION ALL
    -- Level 2: Accounts linked to Level 1 accounts (which are linked to BANK_ACCOUNT1 accounts)
    SELECT
        ba.Customer_id,
        bard_l2.Account_Number,
        bard_l2.Account_type
    FROM
        Bank_Account_Relationship_Details1 bard_l2
    JOIN
        Bank_Account_Relationship_Details1 bard_l1 ON bard_l2.Linking_Account_Number = bard_l1.Account_Number
    JOIN
        BANK_ACCOUNT1 ba ON bard_l1.Linking_Account_Number = ba.Account_Number
    WHERE
        bard_l2.Customer_id IS NULL AND bard_l1.Customer_id IS NULL
)
SELECT
    c.customer_id,
    c.customer_name,
    c.Address,
    c.state_code,
    c.Telephone
FROM
    CUSTOMER1 c
WHERE
    EXISTS (SELECT 1 FROM AccountOwner ao WHERE ao.Customer_id = c.customer_id AND ao.Account_type = 'SAVINGS')
AND
    EXISTS (SELECT 1 FROM AccountOwner ao WHERE ao.Customer_id = c.customer_id AND ao.Account_type IN ('CREDITCARD', 'Credit Card'))
AND
    EXISTS (SELECT 1 FROM AccountOwner ao WHERE ao.Customer_id = c.customer_id AND ao.Account_type = 'Add-on Credit Card');
"""
result = pd.read_sql_query(query, conn)
print(tabulate(result, headers='keys', tablefmt='psql'))

+----+---------------+-----------------+-------------------+--------------+-------------+
|    |   customer_id | customer_name   | Address           | state_code   |   Telephone |
|----+---------------+-----------------+-------------------+--------------+-------------|
|  0 |        123006 | Noah            | 275-9, saint-paul | MN           |  1897613200 |
|  1 |        123007 | Charlie         | 125-1,Richfield   | MN           |  1897617666 |
|  2 |        123006 | Noah            | 275-9, saint-paul | MN           |  1897613200 |
|  3 |        123007 | Charlie         | 125-1,Richfield   | MN           |  1897617666 |
+----+---------------+-----------------+-------------------+--------------+-------------+

In [31]:
# 11)  Display  records of “SAVINGS” account linked with “Credit cards" account_type and its credit
# aggregate sum of transaction amount. (1 Row)
# Ref: Check linking relationship in bank_transaction_relationship_details.
        # Check transaction_amount in bank_account_transaction.
query ="""
SELECT
    ba.Account_Number AS Savings_Account_Number,
    ba.Account_type AS Savings_Account_Type,
    bard.Account_Number AS Linked_Credit_Card_Account_Number,
    SUM(bat.Transaction_amount) AS Aggregate_Credit_Card_Transaction_Amount
FROM
    BANK_ACCOUNT1 ba
JOIN
    Bank_Account_Relationship_Details1 bard ON ba.Account_Number = bard.Linking_Account_Number
JOIN
    BANK_ACCOUNT_TRANSACTION1 bat ON bard.Account_Number = bat.Account_Number
WHERE
    ba.Account_type = 'SAVINGS'
    AND bard.Account_type IN ('CREDITCARD', 'Credit Card')
GROUP BY
    ba.Account_Number, ba.Account_type, bard.Account_Number;
"""
result = pd.read_sql_query(query, conn)
print(tabulate(result, headers='keys', tablefmt='psql'))

+----+--------------------------+------------------------+-------------------------------------+--------------------------------------------+
|    | Savings_Account_Number   | Savings_Account_Type   | Linked_Credit_Card_Account_Number   |   Aggregate_Credit_Card_Transaction_Amount |
|----+--------------------------+------------------------+-------------------------------------+--------------------------------------------|
|  0 | 4000-1956-5698           | SAVINGS                | 5800-1700-9800-7755                 |                                      -9000 |
|  1 | 5000-1700-9800           | SAVINGS                | 9000-1700-7777-4321                 |                                     -15500 |
+----+--------------------------+------------------------+-------------------------------------+--------------------------------------------+